In [1]:
#pandas is data manipulation library
# tabular/excel type of data
# columns and rows 

#why pandas and not numpy ?
# pandas can store numeric and strings also 
# pandas is built on top of numpy

#all the internet data is available in json only
# and json is dictionary in python
import pandas as pd

# pd.read_csv
# pd.read_json
# pd.read_clipboard
# read_sql
# read_clipboard
# titanic['new_columns] =tianic.age > 24
# titanic.pop("columntodelete')
# del titanic["columntodelete]
# titanic.rename({"name": "name_of_passenger"},inplace=True)
# titanic.insert(1,"columnkanaam", np.random.random(891))


# how to connect to a sql database.
# pandas operations

In [ ]:
# problems in numpy


# excel has hetergogenous
# column names nhi hote numpy  mein

# data is csv(comma seperated values)
#

In [2]:
import pandas as pd
import numpy as np

In [6]:
import numpy as np
np.arange(0,9).reshape(3,3)
#there is no way we can add these columns names of this array

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [8]:
{
    {"name": "python",
    "age": 11}, 
    
    {"name": "mayank",
     "age" : 12}
}

TypeError: unhashable type: 'dict'

In [7]:
{"name": "nikita", "age": 13}

{'name': 'nikita', 'age': 13}

In [9]:
# 1. pandas is a open source(can see the code) and free library
# 2. easy for data structure and analysis
# 3. high performance

# Types of Data Structure in pandas

1. series                 - 1diemnsional  - 1-d labelled, homogenous size and immutable in nature.
2. dataframe              - 2 dimensional  - 2-d labelled, heterogenours  , size:mutable
3. panel (not used mainly) - 3 dimensional - 3d labelled, mutable

# PANDAS DATAFRAME
2-dimeniosnal labelled and mutable data structure which stores data in form of rows and columns.

In [13]:
data = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
data #there is no concept of multiple sheets of csv - it can only have one sheet

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [14]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
# Features in pandas- analgolus to tabular data
# can perfomr arithmetic operations
# is mutable (changes can be made inside it.)
# labelled.
# it has rows and columns and inside it it has element/value/entity
# column is called header

In [18]:
print(data[data['PassengerId'] == 5]['Name'])

4    Allen, Mr. William Henry
Name: Name, dtype: object

In [16]:
data['PassengerId'] == 5

0      False
1      False
2      False
3      False
4       True
       ...
886    False
887    False
888    False
889    False
890    False
Name: PassengerId, Length: 891, dtype: bool

In [22]:
pd.DataFrame([1,2,3],columns = ["my first column"]) #provided this list to the dataframe

   my first column
0                1
1                2
2                3

In [26]:
#give names to rows as well
# index is for giving the names of the rows. 

pd.DataFrame([1,2,3],columns = ["my first column"],index= ["row1","row2","row3"])

      my first column
row1                1
row2                2
row3                3

In [28]:
pd.DataFrame({ "col1": [1,2], "col2":[3,4]},index = ["r1","r2"])

    col1  col2
r1     1     3
r2     2     4

In [33]:
# columns needs to be given in a collection only 
# it selects that particular column,
# coz column name toh already de diya hai na.

#in dictionary it selects on the basis of which columns one wants to select on.
pd.DataFrame({"col1": [1,2,3],"col2": [3,4,5]}, index = ["r1","r2","r3"], columns = ["col2","col1"])

    col2  col1
r1     3     1
r2     4     2
r3     5     3

In [34]:
# can even give a new column with no values
pd.DataFrame({"col1": [1,2], "col2":[3,4]},index = ["r1","r2"], columns = ["col0"])

   col0
r1  NaN
r2  NaN

In [35]:
import os
os.getcwd()

'c:\\pvt\\Ineuron\\Python\\Libraries\\PANDAS'

# functions

# importing data to pandas
# headers are just headers - its not part of the data. 

# for read_csv or read_json to work - it always read the file in the form of a file and not within the code file.
# always save it in a file in your directory for this commands to work

# when you are trying to read something, that should be present in your laptop.

In [3]:
titanic= pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [38]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [42]:
#header = None doesnt give the names of the columns at all.

pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv",header = None)

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
...,...,...,...,...,...,...,...,...,...,...,...,...
887,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,NaN,S
888,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,B42,S
889,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C148,C
891,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,NaN,Q

In [43]:
type(titanic)

pandas.core.frame.DataFrame

In [ ]:
titanic.to_csv("titanic_dataset.csv")

In [ ]:
titanic.to_json("tittani.json")

In [ ]:
titanic_from_json = pd.read_json("titanic.json")

In [45]:
titanic_cut = titanic.iloc[0:2] #extracts 0,1 rows only - index means rows so extracts rows only.
titanic_cut

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [46]:
titanic_cut.to_json("titanic_cut.json")

In [48]:
titanic_cut.to_csv("titanic_cut.csv",sep = "|")

In [ ]:
pd.read_sql()

In [47]:
titanic_cut.to_clipboard()
# just copy paste and run this command.

In [ ]:
	PassengerId	Survived	Pclass	Name	Sex	Age	SibSp	Parch	Ticket	Fare	Cabin	Embarked
0	1	0	3	Braund, Mr. Owen Harris	male	22.0	1	0	A/5 21171	7.25		S
1	2	1	1	Cumings, Mrs. John Bradley (Florence Briggs Thayer)	female	38.0	1	0	PC 17599	71.2833	C85	C

In [21]:
pd.DataFrame((1,2,3))

   0
0  1
1  2
2  3

In [54]:
json_data ={
  "name": "John Doe",
  "age": 30,
  "email": "johndoe@example.com",
  "is_student": False,
  "courses": [
    {
      "name": "Mathematics",
      "credits": 4
    },
    {
      "name": "Computer Science",
      "credits": 3
    }
  ]
}

In [55]:
type(json_data)

dict

In [56]:
a= json_data["courses"]
a

[{'name': 'Mathematics', 'credits': 4},
 {'name': 'Computer Science', 'credits': 3}]

In [59]:
pd.DataFrame(a)

               name  credits
0       Mathematics        4
1  Computer Science        3

In [57]:
pd.read_json(a) # as a is not file saved locally in your laptop
# this read function wouldnt work

ValueError: Invalid file path or buffer object type: <class 'list'>

In [ ]:
# Load data from a SQL database

import sqlite3
conn = sqlite3.connect('titanic.db')
titanic_sql = pd.read_sql("select * from passengers",conn)

# OPERATION ON PANDAS

In [60]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [61]:
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
# you cant add rows in numpy array as numpy array are immutable. 
# but in dataframe: we can 
# add, subtract, select rows and columns

# Column operation

In [63]:
titanic['Name']  #got a column

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [68]:
np.random.random(10) # 10 numbers from 0 to 1

array([0.57828291, 0.19148287, 0.03537138, 0.95203072, 0.71089931,
       0.53964666, 0.44989377, 0.22339491, 0.51031752, 0.39323066])

In [70]:
# how to add new column in the existing dataframe
titanic['New_column'] = np.random.random(891) # 891 rows
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New_column
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.102690
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0.246134
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.141553
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0.431172
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.740275
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.408370
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0.282697
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.398542
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0.689851
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.680836

In [71]:
titanic.Age #get the age column

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [72]:
titanic['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [74]:
titanic.Age > 25 # boolean thing should give true and false

0      False
1       True
2       True
3       True
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [78]:
titanic["agegrtr25"] = titanic.Age > 25
titanic #new column added

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,agegrtr25
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,True
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,True
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,True
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,True

In [79]:
titanic.shape #attribute 
# shape is an attribute inside the pandas class thats why no () brackets after that
# only for thing like fucntion we put brackkets.

(891, 13)

In [81]:
titanic.Age + 50

0      72.0
1      88.0
2      76.0
3      85.0
4      85.0
       ...
886    77.0
887    69.0
888     NaN
889    76.0
890    82.0
Name: Age, Length: 891, dtype: float64

In [84]:
titanic["Ageplus50"] = titanic.Age +50
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,agegrtr25,Ageplus50
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False,72.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,True,88.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,76.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,True,85.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,True,85.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,True,77.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,False,69.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,False,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,True,76.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,True,82.0

In [ ]:
# How to delete a column in pandas
del titanic["coluntodelete"]

In [85]:
del titanic["Ageplus50"]

In [86]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,agegrtr25
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,True
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,True
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,True
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,True

In [ ]:
titanic.pop('columntodelete')

In [87]:
# pop returns the columns it is deleting 
# pop is used for deleting onlyy
titanic.pop('Parch')

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    2
889    0
890    0
Name: Parch, Length: 891, dtype: int64

In [88]:
titanic # now it doesnt contain 'Parch' column.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S,True
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S,True
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,W./C. 6607,23.4500,NaN,S,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C,True
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q,True

In [89]:
titanic[['Name','Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [92]:
titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True

In [93]:
# how to rename a column
#give this as a key value pair/dictionary
titanic.rename(columns ={"Name":"Name_of_passenger"})
# as the results are visible it is not permanently saved.

,PassengerId,Survived,Pclass,Name_of_passenger,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S,True
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S,True
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,W./C. 6607,23.4500,NaN,S,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C,True
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q,True

In [94]:
titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True

In [95]:
titanic.rename(columns = {"Name":"Name_of_passenger"},inplace=True)

In [96]:
titanic.head(2)

,PassengerId,Survived,Pclass,Name_of_passenger,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True

# How to insert the column inside the two columns

In [97]:
titanic.insert(1,"random", np.random.random(891)) #inserting the new column in index 1 ie. basically a second column

In [98]:
titanic.head(2)

,PassengerId,random,Survived,Pclass,Name_of_passenger,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
0,1,0.611005,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,False
1,2,0.676265,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True

In [103]:
["breastcancer"]*800 + ["luncancer"]*91

['breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'breastcancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer',
 'luncancer']

In [104]:
titanic.insert(0,"types_of_cancer", ["brca"]*800 + ["lung"]*91)

In [105]:
titanic

,types_of_cancer,PassengerId,random,Survived,Pclass,Name_of_passenger,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
0,brca,1,0.611005,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,False
1,brca,2,0.676265,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True
2,brca,3,0.152982,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S,True
3,brca,4,0.523966,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S,True
4,brca,5,0.532511,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,lung,887,0.173142,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S,True
887,lung,888,0.962580,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S,False
888,lung,889,0.060256,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,W./C. 6607,23.4500,NaN,S,False
889,lung,890,0.743265,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C,True
890,lung,891,0.512920,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q,True

In [106]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

# Indexing and Slicing

In [107]:
l1 = [1,2,3,4]

In [111]:
l1[0:5]

[1, 2, 3, 4]

In [113]:
titanic.head(2)

,types_of_cancer,PassengerId,random,Survived,Pclass,Name_of_passenger,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
0,brca,1,0.611005,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,False
1,brca,2,0.676265,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True

In [114]:
#slice with re to rows
titanic[0:5] #gives the first 5 rows

,types_of_cancer,PassengerId,random,Survived,Pclass,Name_of_passenger,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
0,brca,1,0.611005,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,False
1,brca,2,0.676265,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True
2,brca,3,0.152982,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S,True
3,brca,4,0.523966,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S,True
4,brca,5,0.532511,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S,True

In [116]:
titanic[400:403] #start at 400 , stop at 402

,types_of_cancer,PassengerId,random,Survived,Pclass,Name_of_passenger,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
400,brca,401,0.037139,1,3,"Niskanen, Mr. Juha",male,39.0,0,STON/O 2. 3101289,7.925,NaN,S,True
401,brca,402,0.281355,0,3,"Adams, Mr. John",male,26.0,0,341826,8.050,NaN,S,True
402,brca,403,0.136581,0,3,"Jussila, Miss. Mari Aina",female,21.0,1,4137,9.825,NaN,S,False

In [120]:
titanic[1:11][0:2] #nexted slicing this is across only rows

,types_of_cancer,PassengerId,random,Survived,Pclass,Name_of_passenger,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
1,brca,2,0.676265,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True
2,brca,3,0.152982,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S,True

In [121]:
#take the step while selecting the rows
titanic[1:11:2] #select first 10 rows with s steps in betwen

,types_of_cancer,PassengerId,random,Survived,Pclass,Name_of_passenger,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,agegrtr25
1,brca,2,0.676265,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,True
3,brca,4,0.523966,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S,True
5,brca,6,0.493276,0,3,"Moran, Mr. James",male,NaN,0,330877,8.4583,NaN,Q,False
7,brca,8,0.525370,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,349909,21.0750,NaN,S,False
9,brca,10,0.125244,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,237736,30.0708,NaN,C,False

In [123]:
titanic[1:11,0:2] #i want to select first 10 rows and first 2 columns 
# this doesnt work wrt columns gives an error

InvalidIndexError: (slice(1, 11, None), slice(0, 2, None))

In [122]:
# column across slicing

# iloc
## index location

# iloc doesnt give names/labels of columns at all - its just gives indexing and slicing across rows and columns

# going by index and not name of the column

In [4]:
titanic_3 = titanic.head(3)

In [10]:
col_name =titanic_3.columns
col_name

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [135]:
col_name[2:4] #this is slicing #selects 2nd and 3rd element only

Index(['random', 'Survived'], dtype='object')

In [136]:
col_name[2] # this is indexing

'random'

In [133]:
titanic_3.iloc[0:2,2:4] #first 2 rows and survived and rondom column

     random  Survived
0  0.611005         0
1  0.676265         1

In [140]:
# get the value present on 6th column and 2nd row
titanic_3.iloc[0,5] #give indexes #name of passenger is 6th column

'Braund, Mr. Owen Harris'

In [5]:
titanic_3

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

# Both titanic_3[0:3] and titanic.iloc[0:3] does the same thing
# they both select the first 3 rows ie. 0,1,2 rows

In [7]:
titanic_3[0:3] # and titanic.iloc[0:3] both does the same thing

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [8]:
titanic_3.iloc[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [11]:
# need second column and third column
col_name[2:4] #basic indexing strating from 0

Index(['Pclass', 'Name'], dtype='object')

In [13]:
# goimg by index of column and not name of the column
titanic.iloc[0:2,2:4] #1st row and 2nd and 3rd column. we are starting the indexing from zero only

   Pclass                                               Name
0       3                            Braund, Mr. Owen Harris
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...

In [18]:
# what is the value of 5th column and 1st row
# do indexing from 0,1, only across rows and columns

In [23]:
titanic_3

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [29]:
titanic_3.iloc[1,5] # this gives 1st row and 5th column value exact value
# exact indexing

np.float64(38.0)

In [31]:
# give last row and first 3 coluns
titanic_3.iloc[-1,0:3]

PassengerId    3
Survived       1
Pclass         3
Name: 2, dtype: object

In [37]:
# all the rows and last two columns
titanic_3.iloc[:,-1:-3:-1] #-1 at the end means that columns should be selected in reverse order 
# here we are going(right to left hence the reverse order. )
# what is the normal order?

#it is from -3 to -1 ie. left to right.

  Embarked Cabin
0        S   NaN
1        C   C85
2        S   NaN

In [38]:
col_name

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [40]:
#select last 3 columns
col_name[-1:-4:-1]

Index(['Embarked', 'Cabin', 'Fare'], dtype='object')

In [44]:
col_name[-3:] # till the end sare columns

Index(['Fare', 'Cabin', 'Embarked'], dtype='object')

In [46]:
titanic_3.iloc[:,-3::] #selecting last 3 columns

      Fare Cabin Embarked
0   7.2500   NaN        S
1  71.2833   C85        C
2   7.9250   NaN        S